
/*
  * Уникальный идентификатор внутри менеджера журналов.
    Используется как индекс к конкретному `Journal` в `JournalManager`.

  ? Зачем оборачивать u64 в отдельный тип?
  ! Это распространённый паттерн - "Newtype pattern".
    Суть в нулевых накладных расходах в рантайме (спасибо современным компиляторам)
    и одном неоспоримом плюсе - защита от путаницы между типами.
    Объясню на примере: есть два хранилища, которые используют один тип ключа - u64.
    В таком случае очень легко перепутать два ключа между собой и отдать ключ одного хранилища другому.
*/
#[derive(Debug, Clone, Copy, Eq, Hash, PartialEq)]
pub struct JournalId(u64);

impl JournalId {
  /* 
    ? Почему здесь pub(super), а не pub или pub(crate)?
    ! Чтобы оставить право создания ID строго _внутри_ модуля `journal`.
    - `pub` или `pub(crate)` позволили бы ЛЮБОМУ коду рантайма (сети, UI, Luau VM) 
      создать ID из воздуха в обход генератора. 
    - `pub(super)` дает доступ к конструктору _только_ файлам текущего модуля, 
      превращая менеджер в единственный физический источник ID для всей остальной системы.
  */
  pub(super) fn new(id: u64) -> Self {
    Self(id)
  }

  pub fn as_u64(&self) -> u64 {
    self.0
  }
}
